       ID DIVISION.
       PROGRAM-ID. STATIC1.
      * Demo sample static call in seperate repo 
      * mapped this folder in linkSearch 
      * note shared repos dont trigger pipeline!!!
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.          
           DISPLAY 'STATC1 here v3'.